from telebot.types import Message
from loader import bot
from keyboards.inline.webapp_inline import auth_inline



@bot.message_handler(commands=["start"])
def bot_start(message: Message):
    bot.send_message(message.chat.id, f"Привет, {message.from_user.full_name}!"
                         f"\nЭтот бот предназначен для трекинга привычек.🤖"
                         f"\n\tОсновные функции бота:"
                         f"\n\t• Добавление, редактирование и удаление привычек.✍️"
                         f"\n\t• Фиксация выполнения привычек.☑️"
                         f"\n\t• Регулярное оповещение для соблюдение привычек.🔔"
                         f"\n\nТеперь когда ты изучил предназначение бота нажимай на кнопку 'Главное меню🚪'",
                     reply_markup=auth_inline())



